app/views/users/_unfollow.html.erb

<%= @item_type %>
<%= form_for(current_user.relationships.where("followed_id = ? AND item_type = ?", @user.id, 'User').first,
             :html => { :method => :delete },
             :remote => true) do |f| %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 1 AND ("relationships".follower_id = 4) LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1