app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 4)
---
      <%= render 'follow_form' if signed_in? %>
      <% if @user.posts.any? %>