app/views/shared/_feed_item.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 30) ORDER BY comments.id DESC LIMIT 1
---
			<% if @item_type == 'User' %>
				<% comment = Comment.where("post_id = ? AND user_id = ?", feed_item.id, @user.id).last %>