app/views/shared/_sidebar_info.html.erb

<% end %><br>
<strong>Posts:</strong> <%= @user.posts.count %><br>
---
SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 15)