app/views/shared/_stats.html.erb

          <a href="<%= following_posts_user_path(@user) %>"><p>Following <%= pluralize(@user.following_tags.count, "tag") %></p></a>
          <a href="<%= following_posts_user_path(@user) %>"><p>Following <%= pluralize(@user.following_posts.count, "post") %></a></p>
---
SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 1)