app/views/shared/_user_info.html.erb

			                            </table>
																	<p> <%= pluralize(current_user.posts.count, "post") %></p>
---
SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 1)