app/views/posts/_post.html.erb

  </td>
  <% user = post.user rescue User.find(post.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1