app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build(params[:comment])
    @refresh = "/posts/#{@comment.post_id}"
    if @comment.save
---
INSERT INTO "comments" ("title", "user_id", "post_id", "created_at", "updated_at") VALUES ('dafdasfds', 4, 1, '2011-05-29 23:11:44.685626', '2011-05-29 23:11:44.685626') RETURNING "id"

   def destroy
     @comment = Comment.find(params[:id])
     @refresh = "/posts/#{@comment.post_id}"
     @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 12 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 12