app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @all_events = Event.all