app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 1)
---
  def home
    @title = "Home"
    if signed_in?
      @post = Post.new
      @feed_items = Post.all.paginate(:page => params[:page])