app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "user_id", "created_at", "updated_at", "content") VALUES ('asdfads', 4, '2011-06-16 23:31:50.494193', '2011-06-16 23:31:50.494193', 'adfdasfas') RETURNING "id"
INSERT INTO "tags" ("name") VALUES ('testing') RETURNING "id"
---
  def create
    @post = current_user.posts.build(params[:post])
    @post.tag_list = params[:post][:tag_list].gsub(/\(\w+\)/, '')
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 ORDER BY posts.created_at DESC LIMIT 1
SELECT "comments".* FROM "comments" JOIN (SELECT COALESCE(sum(value), 0) AS score, c.id AS id
SELECT t.name FROM "posts" JOIN taggings AS tg ON tg.taggable_id = posts.id AND tg.taggable_type = 'Post'
---
  def show
    @post = Post.find(params[:id])
    @comment = Comment.new
    @comment.post_id = @post.id
    @c_comment = @post.order_comments