app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
    def create
      if params[:relationship][:item_type] == 'User'
        @following  = User.find(params[:relationship][:followed_id])

SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 2 AND ("relationships".follower_id = 1) LIMIT 1
---
    def destroy
      if params[:item_type] == 'User'
        @following = Relationship.find(params[:id]).followed