app/controllers/tags_controller.rb

  def show
    @item_type = "Tag"
    @tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = 8 LIMIT 1