app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "posts".* FROM "posts" WHERE ("posts".user_id = 1) ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE ("posts".user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin", "expertise", "occupation", "city", "state", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES ('Spencer Kline', 'spencer.kline+5@gmail.com', '2011-06-10 01:28:45.217773', '2011-06-10 01:28:45.217773', 'a9d56d58be6f5cf6895f1f3e4e1c36383bccad9c93bc44d794938cd4eba29e71', 'c6f0b360c388516a9374b06d366ff25d3e6485def2f449f3a1f4560d405b540c', 'f', '', '', '', '', NULL, NULL, NULL, NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "expertise" = '', "occupation" = '', "city" = '', "state" = '', "avatar_file_name" = 'nutra.jpg', "avatar_content_type" = 'image/jpeg', "avatar_file_size" = 81973, "avatar_updated_at" = '2011-06-10 22:31:25.891351', "updated_at" = '2011-06-10 22:31:27.221729' WHERE "users"."id" = 4
---
  def update
    if @user.update_attributes(params[:user])